import { useEffect } from 'react'
import { useUser } from './useUser'

export function ConsoleBanner() {

    const { user } = useUser()

    useEffect(() => {

        const banner = `

        
    █████╗   █████████████████████╗    █████╗
   ██╔══██╗  ██╔═══════██╔═══════██╗  ██╔══██╗
  ██╔╝   ██╗ ███████╗  ██║  ██████╔╝ ██╔╝   ██╗
 ██╔╝     ██╗╚════██║  ██║  ██╔══██╗██╔╝     ██╗
██╔╝      ██████████║  ██║  ██║  █████║       ██╗
╚═╝       ╚═════════╝  ╚═╝  ╚═╝  ╚════╝       ╚═╝   
                                        From ØSX
`

        console.clear()
        console.log(
            `%c${banner}`,
            'color: #6b6b6b;',
            '\n',
            '\n',
            `${user?.profile?.name ? `Olá ${user?.profile?.name}` : 'Seja bem-vindo(a) ao ASTRA'}!`,
            '\n',
            '\n',
            '> Inteligência Espacial Aplicada',
            '\n',
            '\n',
            '- ØSX https://osx-org.vercel.app/',
            '\n',
            '- GitHub https://github.com/Gs-FIAP-OSX',
            '\n',
            '\n'
        )
    })
}